patrick11514/VSB/OSY/osy-workspace.rtos/sem-int/board/pin_mux.h
/*! @name PORTE5 (number 6), J15[P1]/SDHC0_D2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_SDHC0_D2_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_SDHC0_D2_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_SDHC0_D2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTE6 (number 7), J15[G1]/SD_CARD_DETECT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SDHC_CD_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SDHC_CD_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SDHC_CD_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_SDHC_CD_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_SDHC_CD_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHCPins(void);

/*! @name USB0_DP (number 10), J22[3]/K64_MICRO_USB_DP
  @{ */
/* @} */

/*! @name USB0_DM (number 11), J22[2]/K64_MICRO_USB_DN
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBPins(void);

/*! @name PORTA1 (number 35), J1[8]/J1[8]/PTA1
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTA1_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define LED_PTA1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTA1_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define LED_PTA1_PIN 1U                   /*!<@brief PORT pin number */
#define LED_PTA1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTA2 (number 36), J1[12]/J9[6]/TRACE_SWO/J1[12]/J9[6]/TRACE_SWO/PTA2
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTA2_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define LED_PTA2_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTA2_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define LED_PTA2_PIN 2U                   /*!<@brief PORT pin number */
#define LED_PTA2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTC0 (number 70), J1[11]/J1[11]/PTC0
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTC0_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define LED_PTC0_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTC0_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define LED_PTC0_PIN 0U                   /*!<@brief PORT pin number */
#define LED_PTC0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTC1 (number 71), J1[5]/J1[5]/PTC1
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTC1_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define LED_PTC1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTC1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define LED_PTC1_PIN 1U                   /*!<@brief PORT pin number */
#define LED_PTC1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTC2 (number 72), J1[14]/J1[14]/PTC2
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTC2_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define LED_PTC2_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTC2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define LED_PTC2_PIN 2U                   /*!<@brief PORT pin number */
#define LED_PTC2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTC3 (number 73), J1[16]/J1[16]/PTC3
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTC3_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define LED_PTC3_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTC3_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define LED_PTC3_PIN 3U                   /*!<@brief PORT pin number */
#define LED_PTC3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTC4 (number 76), J2[4]/J2[4]/PTC4
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTC4_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define LED_PTC4_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTC4_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define LED_PTC4_PIN 4U                   /*!<@brief PORT pin number */
#define LED_PTC4_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTC5 (number 77), J1[15]/J1[15]/PTC5
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTC5_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define LED_PTC5_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTC5_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define LED_PTC5_PIN 5U                   /*!<@brief PORT pin number */
#define LED_PTC5_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTC7 (number 79), J1[13]/J1[13]/PTC7
  @{ */

