patrick11514/VSB/OSY/osy-workspace.rtos/sem-int/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define LED_PTC7_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define LED_PTC7_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTC7_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define LED_PTC7_PIN 7U                   /*!<@brief PORT pin number */
#define LED_PTC7_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTC8 (number 80), J1[7]/J1[7]/PTC8
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTC8_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define LED_PTC8_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTC8_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define LED_PTC8_PIN 8U                   /*!<@brief PORT pin number */
#define LED_PTC8_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTB2 (number 55), J4[2]/J4[2]/PTB2
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTB2_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define LED_PTB2_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTB2_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define LED_PTB2_PIN 2U                   /*!<@brief PORT pin number */
#define LED_PTB2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTB3 (number 56), J4[4]/J4[4]/PTB3
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTB3_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define LED_PTB3_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTB3_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define LED_PTB3_PIN 3U                   /*!<@brief PORT pin number */
#define LED_PTB3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTB9 (number 57), J1[6]/J1[6]/PTB9
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTB9_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define LED_PTB9_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTB9_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define LED_PTB9_PIN 9U                   /*!<@brief PORT pin number */
#define LED_PTB9_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name PORTB10 (number 58), J4[6]/J4[6]/PTB10
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTB10_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define LED_PTB10_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTB10_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define LED_PTB10_PIN 10U                   /*!<@brief PORT pin number */
#define LED_PTB10_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB11 (number 59), J4[8]/J4[8]/PTB11
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTB11_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define LED_PTB11_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTB11_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define LED_PTB11_PIN 11U                   /*!<@brief PORT pin number */
#define LED_PTB11_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB18 (number 64), J1[1]/J1[1]/PTB18
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTB18_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define LED_PTB18_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTB18_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define LED_PTB18_PIN 18U                   /*!<@brief PORT pin number */
#define LED_PTB18_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB19 (number 65), J1[3]/J1[3]/PTB19
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTB19_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define LED_PTB19_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTB19_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define LED_PTB19_PIN 19U                   /*!<@brief PORT pin number */
#define LED_PTB19_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB20 (number 66), J6[3]/J4[9]/RF_WIFI_CE/J6[3]/J4[9]/RF_WIFI_CE/PTB20
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTB20_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define LED_PTB20_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTB20_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define LED_PTB20_PIN 20U                   /*!<@brief PORT pin number */
#define LED_PTB20_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB23 (number 69), J1[10]/J1[10]/PTB23
  @{ */

/* Symbols to be used with GPIO driver */
#define LED_PTB23_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define LED_PTB23_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LED_PTB23_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define LED_PTB23_PIN 23U                   /*!<@brief PORT pin number */
#define LED_PTB23_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void KIT_LED(void);

/*! @name PORTC9 (number 81), J1[9]/J1[9]/PTC9
  @{ */

