patrick11514/VSB/OSY/osy-workspace.rtos/sem-int/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define SW_PTC9_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define SW_PTC9_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SW_PTC9_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define SW_PTC9_PIN 9U                   /*!<@brief PORT pin number */
#define SW_PTC9_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTC10 (number 82), J4[12]/J4[12]/PTC10
  @{ */

/* Symbols to be used with GPIO driver */
#define SW_PTC10_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define SW_PTC10_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SW_PTC10_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define SW_PTC10_PIN 10U                   /*!<@brief PORT pin number */
#define SW_PTC10_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTC11 (number 83), J4[10]/J4[10]/PTC11
  @{ */

/* Symbols to be used with GPIO driver */
#define SW_PTC11_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define SW_PTC11_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SW_PTC11_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define SW_PTC11_PIN 11U                   /*!<@brief PORT pin number */
#define SW_PTC11_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTC12 (number 84), J2[2]/J2[2]/PTC12
  @{ */

/* Symbols to be used with GPIO driver */
#define SW_PTC12_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define SW_PTC12_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SW_PTC12_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define SW_PTC12_PIN 12U                   /*!<@brief PORT pin number */
#define SW_PTC12_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void KIT_SW(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
